<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>
    <h2>задание 1</h2>
    <?php
    $of = [[1, 2, 3, 4],
        [5, 6, 7, 8],
        [9, 10, 11, 12]];
    foreach ($of as $ofmin) {
        foreach ($ofmin as $num) {
            echo "$num ";
        }
        echo "<br>";
    }
    ?>
    <h2>задание 2</h2>
    <?php
    $of = [[0, 1, 2, 3, 4, 5, 6, 7, 8, 9],[10, 20, 30, 40, 50, 60, 70, 80, 90]];
    foreach($of[1] as $des) {
        foreach($of[0] as $ed){
            $a = ($ed + $des)**2;
            echo "$a ";
        }
        echo "<br>";
    }
    ?>
    <h2>задание 3</h2>
    <?php
    $a = 111111111111111111111111111;
    $b = 0;
    $of = [[1, 3, 5, 4, 2],[2, 5, 6, 8, 4],[3, 1, 4, 3, 2],[0, 1, 4, 5, 6]];
    foreach ($of as $v1) {
        foreach($v1 as $v2)     {
            if ($a > $v2) {
                $a = $v2;
            }
            if ($b < $v2) {
                $b = $v2;
            }
        }
    }
    echo "наибольшее $b, наименьшее $a"
    ?>
    <h2>задание 4</h2>
    <form>
        <input name="n">
        <input type="submit">
    </form>
    <?php
    if(isset($_GET['n'])){
        $n = $_GET['n'];
    }
    $of = [];

    for ($i = 0; $i < $n; $i++) {
        for ($j = 0; $j < $n; $j++) {
        
            if ($j >= $i) {
                $of[$i][$j] = $j - $i;
            } else {
                $of[$i][$j] = $i - $j;
            }
        }
    }
    foreach ($of as $r) {
        foreach ($r as $c) {
            echo "$c ";
        }
        echo "<br>";
    }
    ?>
    <h2>задание 5</h2>
    <?php
    $of = ["мячи" => ["компания1" => "волейболь6ный", "компания2" => "баскетбольный"], "гантели" => ["компания3" => "5 кг", "компания 4" => "10 кг"], "футболки" => ["компания 5" => "маленькая", "компания 6" => "медиум"], "экспандер" => ["компания 7" => "40 кг", "компания 8" => "80 кг"], "велосипеды" => ["компания 9" => "горный", "компания 10" => "городской"]];
    foreach($of as $key1 => $com) {
        echo "$key1 <br>";
        foreach ($com as $key2 => $pro) {
            echo "$key2 => $pro<br>";
        }
    }
    ?>
    <h2>задание 6</h2>
    <?php
    $str = 'cкакалки';
    $of = ["мячи" => ["компания1" => "волейболь6ный", "компания2" => "баскетбольный"], "гантели" => ["компания3" => "5 кг", "компания 4" => "10 кг"], "футболки" => ["компания 5" => "маленькая", "компания 6" => "медиум"], "экспандер" => ["компания 7" => "40 кг", "компания 8" => "80 кг"], "велосипеды" => ["компания 9" => "горный", "компания 10" => "городской"]];
    foreach($of as $key1 => $com) {
        echo "$key1 <br>";
        foreach ($com as $key2 => $pro) {
            echo "$key2 => $pro<br>";
        }
    }
    ?>
    <h2>задание 7</h2>
    <?php
    $off = ["компания 11" => "1 м", "компания 12" => "2 м"];
    $str = 'cкакалки';
    $of = ["мячи" => ["компания1" => "волейболь6ный", "компания2" => "баскетбольный"], "гантели" => ["компания3" => "5 кг", "компания 4" => "10 кг"], "футболки" => ["компания 5" => "маленькая", "компания 6" => "медиум"], "экспандер" => ["компания 7" => "40 кг", "компания 8" => "80 кг"], "велосипеды" => ["компания 9" => "горный", "компания 10" => "городской"]];
    $of[$str] = $off;
    foreach($of as $key1 => $com) {
        echo "$key1 <br>";
        foreach ($com as $key2 => $pro) {
            echo "$key2 => $pro<br>";
        }
    }
    ?>
    <h2>задание 8</h2>
    <?php
    $off = ["компания 11" => "пляжный", "компания 12" => "камень"];
    
    $str = 'мячи';
    $of = ["мячи" => ["компания1" => "волейболь6ный", "компания2" => "баскетбольный"], "гантели" => ["компания3" => "5 кг", "компания 4" => "10 кг"], "футболки" => ["компания 5" => "маленькая", "компания 6" => "медиум"], "экспандер" => ["компания 7" => "40 кг", "компания 8" => "80 кг"], "велосипеды" => ["компания 9" => "горный", "компания 10" => "городской"]];
    foreach($off as $keys => $num){
        foreach($of as $key => $nums) {
            if($key == $keys) {
                $of[$keys][] = $off;
            } else {
                $of[] = $str;
                $of[$str][] = $off;
            }
        }
    }
    $of[$str] = $off;
    foreach($of as $key1 => $com) {
        echo "$key1 <br>";
        foreach ($com as $key2 => $pro) {
            echo "$key2 => $pro<br>";
        }
    }
    ?>
</body>
</html>